tutorials/incompressible/simpleDBSFoam/estsubvolDBS/constant/transportPropertiesRun
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu        nu      [0 2 -1 0 0 0 0] Visc;

kf kf [0 -2 0 0 0 0 0] 0; //KC constant m^-2
momentumSource momentumSource [0 1 -2 0 0 0 0] (PGRAD 0 0); //dP/dL viscous drop
// ************************************************************************* //
