tutorials/incompressible/simpleDBSFoam/estsubvolDBS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.1;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;

    }
    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance        0;
        relTol           0.1;
    }
}

SIMPLE
{
    pRefCell 0;
    pRefValue 0;
    nNonOrthogonalCorrectors 0;

    nS 1;
    cS 0.5;

    residualControl
    {
       p     1e-5;
       U     1e-5;
    }
}

relaxationFactors
{
    p 0.3;
    U 0.3;
}

cache
{
    grad(U);
    grad(p);
}


// ************************************************************************* //
