tutorials/incompressible/simpleDBSFoam/estsubvolDBS/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

direction 0;

x1 0;
x2 .000600;

y1 0;
y2 .000600;

z1 0;
z2 .000600;

velocity volumeAveraged;
pressureDrop momentumSource;